add: documentacion
